import type { Event, Plan } from '@/lib/event-layout'

export const events: Event[] = [
  {
    ID: 1,
    Title: 'BBQ',
    Place: 'BBQ場',
    StartsAt: '2024-09-10T17:10:00.000000+09:00',
    EndsAt: '2024-09-10T19:30:00.000000+09:00',
  },
  {
    ID: 2,
    Title: 'らん☆ぷろ',
    Place: '会議室',
    StartsAt: '2024-09-10T21:00:00.000000+09:00',
    EndsAt: '2024-09-10T22:00:00.000000+09:00',
  },
  {
    ID: 3,
    Title: 'プランA',
    Place: '富士急ハイランド',
    StartsAt: '2024-09-11T09:00:00.000000+09:00',
    EndsAt: '2024-09-11T16:45:00.000000+09:00',
  },
  {
    ID: 4,
    Title: 'プランB',
    Place: 'カチカチ山ロープウェイ',
    StartsAt: '2024-09-11T09:00:00.000000+09:00',
    EndsAt: '2024-09-11T16:45:00.000000+09:00',
  },
  {
    ID: 5,
    Title: 'プランC',
    Place: '青木ヶ原樹海',
    StartsAt: '2024-09-11T09:00:00.000000+09:00',
    EndsAt: '2024-09-11T16:45:00.000000+09:00',
  },
  {
    ID: 6,
    Title: '新体力テスト',
    Place: 'ハンドボールコート',
    StartsAt: '2024-09-10T14:00:00.000000+09:00',
    EndsAt: '2024-09-10T16:00:00.000000+09:00',
  },
  {
    ID: 7,
    Title: '利き水',
    Place: '宴会場',
    StartsAt: '2024-09-10T15:30:00.000000+09:00',
    EndsAt: '2024-09-10T16:30:00.000000+09:00',
  },
  {
    ID: 8,
    Title: '花火',
    Place: 'BBQ場',
    StartsAt: '2024-09-10T19:30:00.000000+09:00',
    EndsAt: '2024-09-10T20:30:00.000000+09:00',
  },
  {
    ID: 9,
    Title: 'リアル脱出ゲーム',
    Place: '会議室',
    StartsAt: '2024-09-10T22:00:00.000000+09:00',
    EndsAt: '2024-09-10T23:30:00.000000+09:00',
  },
  {
    ID: 10,
    Title: 'ややデカ音会',
    Place: 'ミーティングルーム',
    StartsAt: '2024-09-11T20:00:00.000000+09:00',
    EndsAt: '2024-09-11T21:00:00.000000+09:00',
  },
  {
    ID: 11,
    Title: 'プレゼント交換会',
    Place: '食堂',
    StartsAt: '2024-09-11T20:00:00.000000+09:00',
    EndsAt: '2024-09-11T23:00:00.000000+09:00',
  },
]

export const plans: Plan[] = [
  { ID: 1, At: '2024-09-10T10:30:00.000000+09:00', Text: '足柄SAに到着、昼食休憩' },
  { ID: 2, At: '2024-09-10T12:30:00.000000+09:00', Text: '三盛荘到着' },
  { ID: 3, At: '2024-09-10T17:00:00.000000+09:00', Text: 'BBQ場へバス出発' },
  { ID: 4, At: '2024-09-11T01:00:00.000000+09:00', Text: '宴会場完全撤収' },
  { ID: 5, At: '2024-09-11T08:00:00.000000+09:00', Text: '朝食' },
  { ID: 6, At: '2024-09-11T18:00:00.000000+09:00', Text: '夕食' },
]
